dobova86/TinyCLR_Port/Drivers/SPI_F429_Display/STM32F4_SpiDisplay.cpp
#define VIDEO_RAM_SIZE (800*600*2) // Maximum LCD screen size times bytes per pixel
#define UNCACHE_LCD_BUFFER_ADDRESS 0xC0E00000
#define VIDEO_RAM_ADDRESS (UNCACHE_LCD_BUFFER_ADDRESS) // Maximum LCD screen size times bytes per pixel

#define LCD_MAX_ROW	32
#define LCD_MAX_COLUMN 70

enum STM32F4xx_LCD_Rotation {
    rotateNormal_0,
    rotateCW_90,
    rotate_180,
    rotateCCW_90,
};

uint32_t m_STM32F4_SpiDisplayWidth = 0;
uint32_t m_STM32F4_SpiDisplayHeight = 0;
uint32_t m_STM32F4_SpiDisplayPixelClockRateKHz = 0;
uint32_t m_STM32F4_SpiDisplayHorizontalSyncPulseWidth = 0;
uint32_t m_STM32F4_SpiDisplayHorizontalFrontPorch = 0;
uint32_t m_STM32F4_SpiDisplayHorizontalBackPorch = 0;
uint32_t m_STM32F4_SpiDisplayVerticalSyncPulseWidth = 0;
uint32_t m_STM32F4_SpiDisplayVerticalFrontPorch = 0;
uint32_t m_STM32F4_SpiDisplayVerticalBackPorch = 0;
uint32_t m_STM32F4_SpiDisplay_TextRow = 0;
uint32_t m_STM32F4_SpiDisplay_TextColumn = 0;

bool m_STM32F4_SpiDisplayOutputEnableIsFixed = false;
bool m_STM32F4_SpiDisplayOutputEnablePolarity = false;
bool m_STM32F4_SpiDisplayPixelPolarity = false;
bool m_STM32F4_SpiDisplayHorizontalSyncPolarity = false;
bool m_STM32F4_SpiDisplayVerticalSyncPolarity = false;
bool m_STM32F4_SpiDisplayEnable = false;

uint16_t* m_STM32F4_SpiDisplay_VituralRam;
uint8_t m_STM32F4_SpiDisplay_TextBuffer[LCD_MAX_COLUMN][LCD_MAX_ROW];

STM32F4xx_LCD_Rotation m_STM32F4_SpiDisplay_CurrentRotation = STM32F4xx_LCD_Rotation::rotateNormal_0;

bool STM32F4_SpiDisplay_Initialize();
bool STM32F4_SpiDisplay_Uninitialize();
bool STM32F4_SpiDisplay_SetPinConfiguration();

void STM32F4_SpiDisplay_WriteFormattedChar(uint8_t c);
void STM32F4_SpiDisplay_WriteChar(uint8_t c, int32_t row, int32_t col);
void STM32F4_SpiDisplay_BitBltEx(int32_t x, int32_t y, int32_t width, int32_t height, uint32_t data[]);
void STM32F4_SpiDisplay_PaintPixel(uint32_t x, uint32_t y, uint8_t c);
void STM32F4_SpiDisplay_Paint8HorizontalPixels(uint32_t x, uint32_t y, uint8_t p);
void STM32F4_SpiDisplay_TextEnterClearMode();
void STM32F4_SpiDisplay_PrintChracter(uint32_t x, uint32_t y, uint8_t c);
void STM32F4_SpiDisplay_TextShiftColUp();
void STM32F4_SpiDisplay_Clear();
void STM32F4_SpiDisplay_GetRotatedDimensions(int32_t *screenWidth, int32_t *screenHeight);

int32_t STM32F4_SpiDisplay_GetWidth();
int32_t STM32F4_SpiDisplay_GetHeight();
int32_t STM32F4_SpiDisplay_BitPerPixel();
uint32_t STM32F4_SpiDisplay_GetPixelClockDivider();
int32_t STM32F4_SpiDisplay_GetOrientation();
uint32_t* STM32F4_SpiDisplay_GetFrameBuffer();

static TinyCLR_Display_Provider displayProvider;
static TinyCLR_Api_Info displayApi;

bool STM32F4_Ltdc_Initialize(LTDC_HandleTypeDef *hltdc) {
    uint32_t tmp = 0, tmp1 = 0;

    /* Check the LTDC peripheral state */
    if (hltdc == nullptr) {
        return false;
    }

    /* Configures the HS, VS, DE and PC polarity */
    hltdc->Instance->GCR &= ~(LTDC_GCR_HSPOL | LTDC_GCR_VSPOL | LTDC_GCR_DEPOL | LTDC_GCR_PCPOL);
    hltdc->Instance->GCR |= (uint32_t)(hltdc->Init.HSPolarity | hltdc->Init.VSPolarity | \
        hltdc->Init.DEPolarity | hltdc->Init.PCPolarity);

    /* Sets Synchronization size */
    hltdc->Instance->SSCR &= ~(LTDC_SSCR_VSH | LTDC_SSCR_HSW);
    tmp = (hltdc->Init.HorizontalSync << 16);
    hltdc->Instance->SSCR |= (tmp | hltdc->Init.VerticalSync);

    /* Sets Accumulated Back porch */
    hltdc->Instance->BPCR &= ~(LTDC_BPCR_AVBP | LTDC_BPCR_AHBP);
    tmp = (hltdc->Init.AccumulatedHBP << 16);
    hltdc->Instance->BPCR |= (tmp | hltdc->Init.AccumulatedVBP);

    /* Sets Accumulated Active Width */
    hltdc->Instance->AWCR &= ~(LTDC_AWCR_AAH | LTDC_AWCR_AAW);
    tmp = (hltdc->Init.AccumulatedActiveW << 16);
    hltdc->Instance->AWCR |= (tmp | hltdc->Init.AccumulatedActiveH);

    /* Sets Total Width */
    hltdc->Instance->TWCR &= ~(LTDC_TWCR_TOTALH | LTDC_TWCR_TOTALW);
    tmp = (hltdc->Init.TotalWidth << 16);
    hltdc->Instance->TWCR |= (tmp | hltdc->Init.TotalHeigh);

    /* Sets the background color value */
    tmp = ((uint32_t)(hltdc->Init.Backcolor.Green) << 8);
    tmp1 = ((uint32_t)(hltdc->Init.Backcolor.Red) << 16);
    hltdc->Instance->BCCR &= ~(LTDC_BCCR_BCBLUE | LTDC_BCCR_BCGREEN | LTDC_BCCR_BCRED);
    hltdc->Instance->BCCR |= (tmp1 | tmp | hltdc->Init.Backcolor.Blue);

    /* Enable the transfer Error interrupt */
    hltdc->Instance->IER |= LTDC_IER_TERRIE;

    /* Enable the FIFO underrun interrupt */
    hltdc->Instance->IER |= LTDC_IER_FUIE;

    /* Enable LTDC by setting LTDCEN bit */
    hltdc->Instance->GCR |= LTDC_GCR_LTDCEN;

    return true;
}

void STM32F4_Ltdc_SetConfiguration(LTDC_HandleTypeDef *hltdc, LTDC_LayerCfgTypeDef *pLayerCfg, uint32_t LayerIdx) {
    uint32_t tmp = 0;
    uint32_t tmp1 = 0;
    uint32_t tmp2 = 0;

    /* Configures the horizontal start and stop position */
    tmp = ((pLayerCfg->WindowX1 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16)) << 16);
    LTDC_LAYER(hltdc, LayerIdx)->WHPCR &= ~(LTDC_LxWHPCR_WHSTPOS | LTDC_LxWHPCR_WHSPPOS);
    LTDC_LAYER(hltdc, LayerIdx)->WHPCR = ((pLayerCfg->WindowX0 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16) + 1) | tmp);

    /* Configures the vertical start and stop position */
    tmp = ((pLayerCfg->WindowY1 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP)) << 16);
    LTDC_LAYER(hltdc, LayerIdx)->WVPCR &= ~(LTDC_LxWVPCR_WVSTPOS | LTDC_LxWVPCR_WVSPPOS);
    LTDC_LAYER(hltdc, LayerIdx)->WVPCR = ((pLayerCfg->WindowY0 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP) + 1) | tmp);

    /* Specifies the pixel format */
    LTDC_LAYER(hltdc, LayerIdx)->PFCR &= ~(LTDC_LxPFCR_PF);
    LTDC_LAYER(hltdc, LayerIdx)->PFCR = (pLayerCfg->PixelFormat);

    /* Configures the default color values */
    tmp = ((uint32_t)(pLayerCfg->Backcolor.Green) << 8);
    tmp1 = ((uint32_t)(pLayerCfg->Backcolor.Red) << 16);
    tmp2 = (pLayerCfg->Alpha0 << 24);
    LTDC_LAYER(hltdc, LayerIdx)->DCCR &= ~(LTDC_LxDCCR_DCBLUE | LTDC_LxDCCR_DCGREEN | LTDC_LxDCCR_DCRED | LTDC_LxDCCR_DCALPHA);
    LTDC_LAYER(hltdc, LayerIdx)->DCCR = (pLayerCfg->Backcolor.Blue | tmp | tmp1 | tmp2);

