dobova86/TinyCLR_Port/Drivers/SPI_F429_Display/STM32F4_SpiDisplay.cpp
    /* Specifies the constant alpha value */
    LTDC_LAYER(hltdc, LayerIdx)->CACR &= ~(LTDC_LxCACR_CONSTA);
    LTDC_LAYER(hltdc, LayerIdx)->CACR = (pLayerCfg->Alpha);

    /* Specifies the blending factors */
    LTDC_LAYER(hltdc, LayerIdx)->BFCR &= ~(LTDC_LxBFCR_BF2 | LTDC_LxBFCR_BF1);
    LTDC_LAYER(hltdc, LayerIdx)->BFCR = (pLayerCfg->BlendingFactor1 | pLayerCfg->BlendingFactor2);

    /* Configures the color frame buffer start address */
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
    LTDC_LAYER(hltdc, LayerIdx)->CFBAR = (pLayerCfg->FBStartAdress);

    if (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB8888) {
        tmp = 4;
    }
    else if (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_RGB888) {
        tmp = 3;
    }
    else if ((pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB4444) || \
        (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_RGB565) || \
        (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB1555) || \
        (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_AL88)) {
        tmp = 2;
    }
    else {
        tmp = 1;
    }

    /* Configures the color frame buffer pitch in byte */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR &= ~(LTDC_LxCFBLR_CFBLL | LTDC_LxCFBLR_CFBP);
    LTDC_LAYER(hltdc, LayerIdx)->CFBLR = (((pLayerCfg->ImageWidth * tmp) << 16) | (((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) * tmp) + 3));

    /* Configures the frame buffer line number */
    LTDC_LAYER(hltdc, LayerIdx)->CFBLNR &= ~(LTDC_LxCFBLNR_CFBLNBR);
    LTDC_LAYER(hltdc, LayerIdx)->CFBLNR = (pLayerCfg->ImageHeight);

    /* Enable LTDC_Layer by setting LEN bit */
    LTDC_LAYER(hltdc, LayerIdx)->CR |= (uint32_t)LTDC_LxCR_LEN;
}


void STM32F4_Ltdc_LayerConfiguration(LTDC_HandleTypeDef *hltdc, LTDC_LayerCfgTypeDef *pLayerCfg, uint32_t LayerIdx) {
    /* Copy new layer configuration into handle structure */
    hltdc->LayerCfg[LayerIdx] = *pLayerCfg;

    /* Configure the LTDC Layer */
    STM32F4_Ltdc_SetConfiguration(hltdc, pLayerCfg, LayerIdx);

    /* Sets the Reload type */
    hltdc->Instance->SRCR = LTDC_SRCR_IMR;

}

bool STM32F4_SpiDisplay_Initialize() {
    // InitializeConfiguration
    static LTDC_HandleTypeDef hltdc_F;
    LTDC_LayerCfgTypeDef      pLayerCfg;

    RCC->CR &= ~(RCC_CR_PLLSAION);

    STM32F4_Time_Delay(nullptr, 0x10000);

    RCC->PLLSAICFGR = ((0xC0) << 6) | ((0) << 16) | ((0x4) << 24) | ((0x5) << 28);

    MODIFY_REG(RCC->DCKCFGR, RCC_DCKCFGR_PLLSAIDIVR, (uint32_t)(0x00010000));

    RCC->CR |= (RCC_CR_PLLSAION);

    STM32F4_Time_Delay(nullptr, 0x10000);

    RCC->APB2ENR |= RCC_APB2ENR_LTDCEN;

    //HorizontalSyncPolarity
    if (m_STM32F4_SpiDisplayHorizontalSyncPolarity == false)
        hltdc_F.Init.HSPolarity = LTDC_HSPOLARITY_AL;
    else
        hltdc_F.Init.HSPolarity = LTDC_HSPOLARITY_AH;
    //VerticalSyncPolarity
    if (m_STM32F4_SpiDisplayVerticalSyncPolarity == false)
        hltdc_F.Init.VSPolarity = LTDC_VSPOLARITY_AL;
    else
        hltdc_F.Init.VSPolarity = LTDC_VSPOLARITY_AH;

    //OutputEnablePolarity
    if (m_STM32F4_SpiDisplayOutputEnablePolarity == false)
        hltdc_F.Init.DEPolarity = LTDC_DEPOLARITY_AL;
    else
        hltdc_F.Init.DEPolarity = LTDC_DEPOLARITY_AH;

    //OutputEnablePolarity
    if (m_STM32F4_SpiDisplayPixelPolarity == false)
        hltdc_F.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
    else
        hltdc_F.Init.PCPolarity = LTDC_GCR_PCPOL;

	// Note: Force setting, managed library doesn't pass correctly the settings
	hltdc_F.Init.HSPolarity = LTDC_HSPOLARITY_AL;
    hltdc_F.Init.VSPolarity = LTDC_VSPOLARITY_AL;
    hltdc_F.Init.DEPolarity = LTDC_DEPOLARITY_AL;
    hltdc_F.Init.PCPolarity = LTDC_PCPOLARITY_IPC;



    /* The RK043FN48H LCD 480x272 is selected */
    /* Timing Configuration */
    hltdc_F.Init.HorizontalSync = (m_STM32F4_SpiDisplayHorizontalSyncPulseWidth - 1);
    hltdc_F.Init.VerticalSync = (m_STM32F4_SpiDisplayVerticalSyncPulseWidth - 1);
    hltdc_F.Init.AccumulatedHBP = (m_STM32F4_SpiDisplayHorizontalSyncPulseWidth + m_STM32F4_SpiDisplayHorizontalBackPorch - 1);
    hltdc_F.Init.AccumulatedVBP = (m_STM32F4_SpiDisplayVerticalSyncPulseWidth + m_STM32F4_SpiDisplayVerticalBackPorch - 1);
    hltdc_F.Init.AccumulatedActiveH = (m_STM32F4_SpiDisplayHeight + m_STM32F4_SpiDisplayVerticalSyncPulseWidth + m_STM32F4_SpiDisplayVerticalBackPorch - 1);
    hltdc_F.Init.AccumulatedActiveW = (m_STM32F4_SpiDisplayWidth + m_STM32F4_SpiDisplayHorizontalSyncPulseWidth + m_STM32F4_SpiDisplayHorizontalBackPorch - 1);
    hltdc_F.Init.TotalHeigh = (m_STM32F4_SpiDisplayHeight + m_STM32F4_SpiDisplayVerticalSyncPulseWidth + m_STM32F4_SpiDisplayVerticalBackPorch + m_STM32F4_SpiDisplayVerticalFrontPorch - 1);
    hltdc_F.Init.TotalWidth = (m_STM32F4_SpiDisplayWidth + m_STM32F4_SpiDisplayHorizontalSyncPulseWidth + m_STM32F4_SpiDisplayHorizontalBackPorch + m_STM32F4_SpiDisplayHorizontalFrontPorch - 1);
    /* Layer1 Configuration ------------------------------------------------------*/

    /* Windowing configuration */
    /* In this case all the active display area is used to display a picture then :
     Horizontal start = horizontal synchronization + Horizontal back porch = 43
     Vertical start   = vertical synchronization + vertical back porch     = 12
     Horizontal stop = Horizontal start + window width -1 = 43 + 480 -1
     Vertical stop   = Vertical start + window height -1  = 12 + 272 -1      */
    pLayerCfg.WindowX0 = 0;
    pLayerCfg.WindowX1 = m_STM32F4_SpiDisplayWidth;
    pLayerCfg.WindowY0 = 0;
    pLayerCfg.WindowY1 = m_STM32F4_SpiDisplayHeight;

    /* Configure R,G,B component values for LCD background color : all black background */
    hltdc_F.Init.Backcolor.Blue = 0;
    hltdc_F.Init.Backcolor.Green = 0;
    hltdc_F.Init.Backcolor.Red = 0;

    hltdc_F.Instance = LTDC;

    /* Pixel Format configuration*/
    pLayerCfg.PixelFormat = LTDC_PIXEL_FORMAT_RGB565;

    /* Start Address configuration : frame buffer is located at FLASH memory */
    pLayerCfg.FBStartAdress = (uint32_t)VIDEO_RAM_ADDRESS;

