dobova86/TinyCLR_Port/Drivers/SPI_F429_Display/STM32F4_SpiDisplay.cpp
    /* Alpha constant (255 == totally opaque) */
    pLayerCfg.Alpha = 255;

    /* Default Color configuration (configure A,R,G,B component values) : no background color */
    pLayerCfg.Alpha0 = 0; /* fully transparent */
    pLayerCfg.Backcolor.Blue = 0;
    pLayerCfg.Backcolor.Green = 0;
    pLayerCfg.Backcolor.Red = 0;

    /* Configure blending factors */
    pLayerCfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_CA;
    pLayerCfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_CA;

    /* Configure the number of lines and number of pixels per line */
    pLayerCfg.ImageWidth = pLayerCfg.WindowX1;
    pLayerCfg.ImageHeight = pLayerCfg.WindowY1;

    /* Configure the LTDC */
    if (!STM32F4_Ltdc_Initialize(&hltdc_F)) {
        return false;
    }

    /* Configure the Layer*/
    STM32F4_Ltdc_LayerConfiguration(&hltdc_F, &pLayerCfg, 1);

    m_STM32F4_SpiDisplayEnable = true;

    return true;
}

bool STM32F4_SpiDisplay_Uninitialize() {
    m_STM32F4_SpiDisplayEnable = false;

    return true;
}

//====================================================
void STM32F4_SpiDisplay_WriteFormattedChar(uint8_t c) {
    if (m_STM32F4_SpiDisplayEnable == false)
        return;

    if (c == '\f') {
        STM32F4_SpiDisplay_Clear();
        STM32F4_SpiDisplay_TextEnterClearMode();
        m_STM32F4_SpiDisplay_TextColumn = 0;

        return;
    }

    if (c == '\r') {
        m_STM32F4_SpiDisplay_TextColumn = 0;

        return;
    }
    if (c == '\n') {
        m_STM32F4_SpiDisplay_TextColumn = 0;

        if (++m_STM32F4_SpiDisplay_TextRow >= LCD_MAX_ROW) {
            m_STM32F4_SpiDisplay_TextRow = LCD_MAX_ROW - 1;
            STM32F4_SpiDisplay_TextShiftColUp();
        }
        // clean the new line
        for (c = 0; c < (LCD_MAX_COLUMN - 1); c++) {
            m_STM32F4_SpiDisplay_TextBuffer[c][m_STM32F4_SpiDisplay_TextRow] = ' ';
        }

        return;
    }

    STM32F4_SpiDisplay_PrintChracter(m_STM32F4_SpiDisplay_TextColumn * 6, m_STM32F4_SpiDisplay_TextRow * 8, c);
    m_STM32F4_SpiDisplay_TextBuffer[m_STM32F4_SpiDisplay_TextColumn][m_STM32F4_SpiDisplay_TextRow] = c;

    if (++m_STM32F4_SpiDisplay_TextColumn >= (LCD_MAX_COLUMN - 1)) {
        m_STM32F4_SpiDisplay_TextColumn = 0;

        if (++m_STM32F4_SpiDisplay_TextRow >= LCD_MAX_ROW) {
            m_STM32F4_SpiDisplay_TextRow = LCD_MAX_ROW - 1;
            STM32F4_SpiDisplay_TextShiftColUp();
        }
        else {
            // clean the new line
            for (c = 0; c < LCD_MAX_COLUMN; c++) {
                m_STM32F4_SpiDisplay_TextBuffer[c][m_STM32F4_SpiDisplay_TextRow] = ' ';
            }
        }
    }
}
//=======================================================
void STM32F4_SpiDisplay_PaintPixel(uint32_t x, uint32_t y, uint8_t c) {
    volatile uint16_t * loc;

    if (m_STM32F4_SpiDisplayEnable == false)
        return;

    if (x >= m_STM32F4_SpiDisplayWidth)
        return;
    if (y >= m_STM32F4_SpiDisplayHeight)
        return;

    loc = m_STM32F4_SpiDisplay_VituralRam + (y *m_STM32F4_SpiDisplayWidth) + (x);

    if (c)
        *loc = 0x0fff;
    else
        *loc = 0;
}
//=======================================================
void STM32F4_SpiDisplay_Paint8HorizontalPixels(uint32_t x, uint32_t y, uint8_t p) {
    if (m_STM32F4_SpiDisplayEnable == false)
        return;

    for (int32_t i = 0; i < 8; i++) {
        if (p&(1 << i))
            STM32F4_SpiDisplay_PaintPixel(x, y + i, 1);
        else
            STM32F4_SpiDisplay_PaintPixel(x, y + i, 0);//clear
    }
}
//===========================================================
void STM32F4_SpiDisplay_TextEnterClearMode() {
    uint32_t r, c;

    if (m_STM32F4_SpiDisplayEnable == false)
        return;

    STM32F4_SpiDisplay_Clear();
    m_STM32F4_SpiDisplay_TextRow = 0;
    m_STM32F4_SpiDisplay_TextColumn = 0;

    for (r = 0; r < LCD_MAX_ROW; r++) {
        for (c = 0; c < (LCD_MAX_COLUMN - 1); c++) {
            m_STM32F4_SpiDisplay_TextBuffer[c][r] = '1';
        }
    }
}
//===========================================================
void STM32F4_SpiDisplay_PrintChracter(uint32_t x, uint32_t y, uint8_t c) {
    uint8_t i;

    if (m_STM32F4_SpiDisplayEnable == false)
        return;

    for (i = 0; i < 5; i++)
        STM32F4_SpiDisplay_Paint8HorizontalPixels(x + i, y, characters[c][i]);

    STM32F4_SpiDisplay_Paint8HorizontalPixels(x + i, y, 0);
}

void STM32F4_SpiDisplay_TextShiftColUp() {
    uint32_t r, c;

    if (m_STM32F4_SpiDisplayEnable == false)
        return;

    // refresh with new data
    STM32F4_SpiDisplay_Clear();
    m_STM32F4_SpiDisplay_TextRow = 0;
    m_STM32F4_SpiDisplay_TextColumn = 0;

    for (r = 0; r < (LCD_MAX_ROW - 1); r++) {
        for (c = 0; c < LCD_MAX_COLUMN - 1; c++) {
            m_STM32F4_SpiDisplay_TextBuffer[c][r] = m_STM32F4_SpiDisplay_TextBuffer[c][r + 1];
            STM32F4_SpiDisplay_WriteFormattedChar(m_STM32F4_SpiDisplay_TextBuffer[c][r]);
        }
    }
}

void STM32F4_SpiDisplay_Clear() {
    if (m_STM32F4_SpiDisplayEnable == false)
        return;

    memset((uint32_t*)m_STM32F4_SpiDisplay_VituralRam, 0, VIDEO_RAM_SIZE);
}

const STM32F4_Gpio_Pin g_Display_ControllerPins[] = STM32F4_DISPLAY_CONTROLLER_PINS;
const STM32F4_Gpio_Pin g_Display_BacklightPin = STM32F4_DISPLAY_BACKLIGHT_PIN;
const STM32F4_Gpio_Pin g_Display_EnablePin = STM32F4_DISPLAY_ENABLE_PIN;


bool  STM32F4_SpiDisplay_SetPinConfiguration() {
    for (int32_t i = 0; i < SIZEOF_ARRAY(g_Display_ControllerPins); i++) {
        STM32F4_GpioInternal_ConfigurePin(g_Display_ControllerPins[i].number, STM32F4_Gpio_PortMode::AlternateFunction, STM32F4_Gpio_OutputType::PushPull, STM32F4_Gpio_OutputSpeed::High, STM32F4_Gpio_PullDirection::None, g_Display_ControllerPins[i].alternateFunction);
    }

    if (m_STM32F4_SpiDisplayOutputEnableIsFixed) {
        STM32F4_GpioInternal_ConfigurePin(g_Display_EnablePin.number, STM32F4_Gpio_PortMode::GeneralPurposeOutput, STM32F4_Gpio_OutputType::PushPull, STM32F4_Gpio_OutputSpeed::High, STM32F4_Gpio_PullDirection::None, STM32F4_Gpio_AlternateFunction::AF0);
        STM32F4_GpioInternal_WritePin(g_Display_EnablePin.number, m_STM32F4_SpiDisplayOutputEnablePolarity);
    }
    else {
        STM32F4_GpioInternal_ConfigurePin(g_Display_EnablePin.number, STM32F4_Gpio_PortMode::AlternateFunction, STM32F4_Gpio_OutputType::PushPull, STM32F4_Gpio_OutputSpeed::High, STM32F4_Gpio_PullDirection::None, g_Display_EnablePin.alternateFunction);
    }

    // backlight D7
    STM32F4_GpioInternal_ConfigurePin(g_Display_BacklightPin.number, STM32F4_Gpio_PortMode::GeneralPurposeOutput, STM32F4_Gpio_OutputType::PushPull, STM32F4_Gpio_OutputSpeed::High, STM32F4_Gpio_PullDirection::None, g_Display_BacklightPin.alternateFunction);
    STM32F4_GpioInternal_WritePin(g_Display_BacklightPin.number, true);

