dobova86/TinyCLR_Port/Drivers/SPI_F429_Display/STM32F4_SpiDisplay.cpp
    return true;
}
uint32_t* STM32F4_SpiDisplay_GetFrameBuffer() {
    return (uint32_t*)m_STM32F4_SpiDisplay_VituralRam;
}

int32_t STM32F4_SpiDisplay_GetWidth() {
    int32_t width = m_STM32F4_SpiDisplayWidth;
    int32_t height = m_STM32F4_SpiDisplayHeight;

    STM32F4_SpiDisplay_GetRotatedDimensions(&width, &height);

    return width;
}

int32_t STM32F4_SpiDisplay_GetHeight() {
    int32_t width = m_STM32F4_SpiDisplayWidth;
    int32_t height = m_STM32F4_SpiDisplayHeight;

    STM32F4_SpiDisplay_GetRotatedDimensions(&width, &height);

    return height;
}

uint32_t STM32F4_SpiDisplay_GetPixelClockDivider() {
    return m_STM32F4_SpiDisplayPixelClockRateKHz;
}
int32_t STM32F4_SpiDisplay_GetOrientation() {
    return m_STM32F4_SpiDisplay_CurrentRotation;
}

void  STM32F4_SpiDisplay_MemCopy(void *dest, void *src, int32_t size) {
    const int32_t MEMCOPY_BYTES_ALIGNED = 8;

    uint64_t *from64 = (uint64_t *)src;
    uint64_t *to64 = (uint64_t *)dest;

    int32_t block = size / MEMCOPY_BYTES_ALIGNED;
    int32_t remainder = size % MEMCOPY_BYTES_ALIGNED;

    while (block > 0) {
        *to64++ = *from64++;
        block--;
    }

    if (remainder > 0) {
        uint8_t *from8 = (uint8_t *)from64;
        uint8_t *to8 = (uint8_t *)to64;

        while (remainder > 0) {
            *to8++ = *from8++;

            remainder--;
        }
    }
}

void STM32F4_SpiDisplay_BitBltEx(int32_t x, int32_t y, int32_t width, int32_t height, uint32_t data[]) {

    int32_t xTo, yTo, xFrom, yFrom;
    int32_t xOffset = x;
    int32_t yOffset = y;
    uint16_t *from = (uint16_t *)data;
    uint16_t *to = (uint16_t *)m_STM32F4_SpiDisplay_VituralRam;


    int32_t screenWidth = m_STM32F4_SpiDisplayWidth;
    int32_t screenHeight = m_STM32F4_SpiDisplayHeight;
    int32_t startPx, toAddition;

    if (m_STM32F4_SpiDisplayEnable == false)
        return;

    switch (m_STM32F4_SpiDisplay_CurrentRotation) {
    case STM32F4xx_LCD_Rotation::rotateNormal_0:

        if (xOffset == 0 && yOffset == 0 &&
            width == screenWidth && height == screenHeight) {
            STM32F4_SpiDisplay_MemCopy(to, from, (screenWidth*screenHeight * 2));
        }
        else {
            for (yTo = yOffset; yTo < (yOffset + height); yTo++) {
                STM32F4_SpiDisplay_MemCopy((void*)(to + yTo * screenWidth + xOffset), (void*)(from + yTo * screenWidth + xOffset), (width * 2));
            }
        }

        break;

    case STM32F4xx_LCD_Rotation::rotateCCW_90:

        startPx = yOffset * screenHeight;
        xFrom = xOffset + width;
        yTo = screenHeight - xOffset - width;
        xTo = yOffset;
        to += yTo * screenWidth + xTo;
        toAddition = screenWidth - height;

        for (; yTo < (screenHeight - xOffset); yTo++) {
            xFrom--;
            yFrom = startPx + xFrom;

            for (xTo = yOffset; xTo < (yOffset + height); xTo++) {
                *to++ = from[yFrom];
                yFrom += screenHeight;
            }

            to += toAddition;
        }

        break;

    case STM32F4xx_LCD_Rotation::rotateCW_90:

        startPx = (yOffset + height - 1) * screenHeight;
        xFrom = xOffset;

        yTo = xOffset;
        xTo = screenWidth - yOffset - height;
        to += yTo * screenWidth + xTo;
        toAddition = screenWidth - height;

        for (; yTo < (xOffset + width); yTo++) {
            yFrom = startPx + xFrom;

            for (xTo = screenWidth - yOffset - height; xTo < (screenWidth - yOffset); xTo++) {
                *to++ = from[yFrom];
                yFrom -= screenHeight;
            }

            to += toAddition;
            xFrom++;
        }

        break;

    case STM32F4xx_LCD_Rotation::rotate_180:

        xFrom = (yOffset + height - 1) * screenWidth + xOffset + width;

        yTo = screenHeight - yOffset - height;
        xTo = screenWidth - xOffset - width;
        to += yTo * screenWidth + xTo;
        toAddition = screenWidth - width;

        for (; yTo < (screenHeight - yOffset); yTo++) {

            for (xTo = screenWidth - xOffset - width; xTo < (screenWidth - xOffset); xTo++) {
                xFrom--;
                *to++ = from[xFrom];
            }

            to += toAddition;
            xFrom -= toAddition;
        }

        break;
    }

}

void STM32F4_SpiDisplay_WriteChar(uint8_t c, int32_t row, int32_t col) {
    m_STM32F4_SpiDisplay_TextRow = row;
    m_STM32F4_SpiDisplay_TextColumn = col;
    STM32F4_SpiDisplay_WriteFormattedChar(c);

}
void STM32F4_SpiDisplay_GetRotatedDimensions(int32_t *screenWidth, int32_t *screenHeight) {
    switch (m_STM32F4_SpiDisplay_CurrentRotation) {
    case STM32F4xx_LCD_Rotation::rotateNormal_0:
    case STM32F4xx_LCD_Rotation::rotate_180:
        *screenWidth = m_STM32F4_SpiDisplayWidth;
        *screenHeight = m_STM32F4_SpiDisplayHeight;
        break;

    case STM32F4xx_LCD_Rotation::rotateCCW_90:
    case STM32F4xx_LCD_Rotation::rotateCW_90:
        *screenWidth = m_STM32F4_SpiDisplayHeight;
        *screenHeight = m_STM32F4_SpiDisplayWidth;
        break;
    }
}

TinyCLR_Result STM32F4_SpiDisplay_Acquire(const TinyCLR_Display_Provider* self) {
    m_STM32F4_SpiDisplay_CurrentRotation = STM32F4xx_LCD_Rotation::rotateNormal_0;

    m_STM32F4_SpiDisplay_VituralRam = (uint16_t*)VIDEO_RAM_ADDRESS;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SpiDisplay_Release(const TinyCLR_Display_Provider* self) {
    if (STM32F4_SpiDisplay_Uninitialize())
        return TinyCLR_Result::Success;

    return  TinyCLR_Result::InvalidOperation;
}

TinyCLR_Result STM32F4_SpiDisplay_Enable(const TinyCLR_Display_Provider* self) {
    if (STM32F4_SpiDisplay_SetPinConfiguration() && STM32F4_SpiDisplay_Initialize())
        return TinyCLR_Result::Success;

    return TinyCLR_Result::InvalidOperation;
}

TinyCLR_Result STM32F4_SpiDisplay_Disable(const TinyCLR_Display_Provider* self) {
    return TinyCLR_Result::NotSupported;
}

TinyCLR_Result STM32F4_SpiDisplay_SetConfiguration(const TinyCLR_Display_Provider* self, TinyCLR_Display_DataFormat dataFormat, uint32_t width, uint32_t height, const void* configuration) {
    if (dataFormat != TinyCLR_Display_DataFormat::Rgb565) return TinyCLR_Result::NotSupported;

