dobova86/TinyCLR_Port/Drivers/SPI_F429_Display/STM32F4_SpiDisplay.cpp
    m_STM32F4_SpiDisplayWidth = width;
    m_STM32F4_SpiDisplayHeight = height;

    if (configuration != nullptr) {
        auto& cfg = *(const TinyCLR_Display_ParallelConfiguration*)configuration;

        m_STM32F4_SpiDisplayOutputEnableIsFixed = cfg.DataEnableIsFixed;
        m_STM32F4_SpiDisplayOutputEnablePolarity = cfg.DataEnablePolarity;
        m_STM32F4_SpiDisplayPixelPolarity = cfg.PixelPolarity;

        m_STM32F4_SpiDisplayPixelClockRateKHz = cfg.PixelClockRate / 1000;

        m_STM32F4_SpiDisplayHorizontalSyncPolarity = cfg.HorizontalSyncPolarity;

        m_STM32F4_SpiDisplayHorizontalSyncPulseWidth = cfg.HorizontalSyncPulseWidth;
        m_STM32F4_SpiDisplayHorizontalFrontPorch = cfg.HorizontalFrontPorch;
        m_STM32F4_SpiDisplayHorizontalBackPorch = cfg.HorizontalBackPorch;

        m_STM32F4_SpiDisplayVerticalSyncPolarity = cfg.VerticalSyncPolarity;

        m_STM32F4_SpiDisplayVerticalSyncPulseWidth = cfg.VerticalSyncPulseWidth;
        m_STM32F4_SpiDisplayVerticalFrontPorch = cfg.VerticalFrontPorch;
        m_STM32F4_SpiDisplayVerticalBackPorch = cfg.VerticalBackPorch;
    }

    return  TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SpiDisplay_GetConfiguration(const TinyCLR_Display_Provider* self, TinyCLR_Display_DataFormat& dataFormat, uint32_t& width, uint32_t& height, void* configuration) {
    dataFormat = TinyCLR_Display_DataFormat::Rgb565;
    width = m_STM32F4_SpiDisplayWidth;
    height = m_STM32F4_SpiDisplayHeight;

    if (configuration != nullptr) {
        auto& cfg = *(TinyCLR_Display_ParallelConfiguration*)configuration;

        cfg.DataEnableIsFixed = m_STM32F4_SpiDisplayOutputEnableIsFixed;
        cfg.DataEnablePolarity = m_STM32F4_SpiDisplayOutputEnablePolarity;
        cfg.PixelPolarity = m_STM32F4_SpiDisplayPixelPolarity;

        cfg.PixelClockRate = m_STM32F4_SpiDisplayPixelClockRateKHz * 1000;

        cfg.HorizontalSyncPolarity = m_STM32F4_SpiDisplayHorizontalSyncPolarity;

        cfg.HorizontalSyncPulseWidth = m_STM32F4_SpiDisplayHorizontalSyncPulseWidth;
        cfg.HorizontalFrontPorch = m_STM32F4_SpiDisplayHorizontalFrontPorch;
        cfg.HorizontalBackPorch = m_STM32F4_SpiDisplayHorizontalBackPorch;

        cfg.VerticalSyncPolarity = m_STM32F4_SpiDisplayVerticalSyncPolarity;

        cfg.VerticalSyncPulseWidth = m_STM32F4_SpiDisplayVerticalSyncPulseWidth;
        cfg.VerticalFrontPorch = m_STM32F4_SpiDisplayVerticalFrontPorch;
        cfg.VerticalBackPorch = m_STM32F4_SpiDisplayVerticalBackPorch;
    }

    return TinyCLR_Result::InvalidOperation;
}

TinyCLR_Result STM32F4_SpiDisplay_DrawBuffer(const TinyCLR_Display_Provider* self, int32_t x, int32_t y, int32_t width, int32_t height, const uint8_t* data) {
    STM32F4_SpiDisplay_BitBltEx(x, y, width, height, (uint32_t*)data);
    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SpiDisplay_WriteString(const TinyCLR_Display_Provider* self, const char* buffer, size_t length) {
    for (size_t i = 0; i < length; i++)
        STM32F4_SpiDisplay_WriteFormattedChar(buffer[i]);

    return TinyCLR_Result::Success;
}

TinyCLR_Display_DataFormat dataFormats[] = { TinyCLR_Display_DataFormat::Rgb565 };

TinyCLR_Result STM32F4_SpiDisplay_GetCapabilities(const TinyCLR_Display_Provider* self, TinyCLR_Display_InterfaceType& type, const TinyCLR_Display_DataFormat*& supportedDataFormats, size_t& supportedDataFormatCount) {
    type = TinyCLR_Display_InterfaceType::Parallel;
    supportedDataFormatCount = SIZEOF_ARRAY(dataFormats);
    supportedDataFormats = dataFormats;

    return TinyCLR_Result::Success;
}

const TinyCLR_Api_Info* STM32F4_SpiDisplay_GetApi() {
    displayProvider.Parent = &displayApi;
    displayProvider.Index = 0;
    displayProvider.Acquire = &STM32F4_SpiDisplay_Acquire;
    displayProvider.Release = &STM32F4_SpiDisplay_Release;
    displayProvider.Enable = &STM32F4_SpiDisplay_Enable;
    displayProvider.Disable = &STM32F4_SpiDisplay_Disable;
    displayProvider.SetConfiguration = &STM32F4_SpiDisplay_SetConfiguration;
    displayProvider.GetConfiguration = &STM32F4_SpiDisplay_GetConfiguration;
    displayProvider.GetCapabilities = &STM32F4_SpiDisplay_GetCapabilities;
    displayProvider.DrawBuffer = &STM32F4_SpiDisplay_DrawBuffer;
    displayProvider.WriteString = &STM32F4_SpiDisplay_WriteString;

    displayApi.Author = "GHI Electronics, LLC";
    displayApi.Name = "GHIElectronics.TinyCLR.NativeApis.STM32F4.DisplayProvider";
    displayApi.Type = TinyCLR_Api_Type::DisplayProvider;
    displayApi.Version = 0;
    displayApi.Count = 1;
    displayApi.Implementation = &displayProvider;

    return &displayApi;
}

void STM32F4_SpiDisplay_Reset() {
    STM32F4_SpiDisplay_Clear();

    if (m_STM32F4_SpiDisplayEnable)
        STM32F4_SpiDisplay_Uninitialize();

    m_STM32F4_SpiDisplayEnable = false;
}

// Utility function to prepare SPI display via serial wires
/**
* @brief  Writes register value.
*/
void LCD_IO_WriteData(uint16_t RegValue)
{
	/* Set WRX to send data */
	LCD_WRX_HIGH();

	/* Reset LCD control line(/CS) and Send data */
	LCD_CS_LOW();
	SPIx_Write(RegValue);

	/* Deselect: Chip Select high */
	LCD_CS_HIGH();
}

/**
* @brief  Writes register address.
*/
void LCD_IO_WriteReg(uint8_t Reg)
{
	/* Reset WRX to send command */
	LCD_WRX_LOW();

	/* Reset LCD control line(/CS) and Send command */
	LCD_CS_LOW();
	SPIx_Write(Reg);

	/* Deselect: Chip Select high */
	LCD_CS_HIGH();
}

/**
* @brief  Reads register value.
* @param  RegValue Address of the register to read
* @param  ReadSize Number of bytes to read
* @retval Content of the register value
*/
uint32_t LCD_IO_ReadData(uint16_t RegValue, uint8_t ReadSize)
{
	uint32_t readvalue = 0;

	/* Select: Chip Select low */
	LCD_CS_LOW();

	/* Reset WRX to send command */
	LCD_WRX_LOW();

	SPIx_Write(RegValue);

	readvalue = SPIx_Read(ReadSize);

	/* Set WRX to send data */
	LCD_WRX_HIGH();

	/* Deselect: Chip Select high */
	LCD_CS_HIGH();

	return readvalue;
}



#endif //INCLUDE_DISPLAY
